{
  "tempo": [
    "The typical speed at which a piece of music is played, measured in beats per minute.",
    "The standard number of beats in one minute of music.",
    "The rate at which beats occur within a song.",
    "The musical pace, calculated as beats per minute.",
    "The time interval between beats, expressed in BPM.",
    "The consistent rhythm measured over one minute of music.",
    "The speed or velocity of a musical piece, determined in BPM.",
    "The beat frequency per minute in a song.",
    "The time signature's pace, typically noted in BPM.",
    "The tempo of a track, quantified by how many beats occur per minute.",
    "The average speed at which the notes are played in a composition.",
    "The rhythmic flow of a piece of music in beats per minute.",
    "The pulse of the music, described in terms of BPM.",
    "The frequency of beats occurring within 60 seconds of a track.",
    "The underlying pace or speed at which the music progresses.",
    "The rate at which the underlying beat of a song occurs, measured per minute.",
    "The frequency of musical beats over the span of one minute.",
    "The tempo marking, signifying how many beats occur each minute.",
    "The speed at which a musical composition is performed.",
    "The number of beats that can be counted in a minute.",
    "The tempo’s average measure in beats over a minute’s time.",
    "The pulse of the song, characterized by beats per minute.",
    "The rhythmic speed of a musical composition.",
    "The number of pulses in a song that occur within 60 seconds.",
    "The tempo or velocity at which a piece of music moves forward.",
    "The frequency with which musical beats happen in one minute.",
    "The tempo rate of a musical piece, often indicated in BPM.",
    "The speed at which the rhythm section follows, counted in beats per minute.",
    "The cadence of a track, signifying beats in each minute.",
    "The speed of the song's underlying rhythm.",
    "The rate of rhythmic progression within 60 seconds.",
    "The musical pulse expressed as a rate of beats every minute.",
    "The overall rhythmic speed as quantified in beats per minute.",
    "The duration between individual beats, averaged per minute.",
    "The pace of a song, as indicated by BPM.",
    "The rhythmic intensity of a piece, shown by beats per minute.",
    "The frequency of the music’s pulse within the span of a minute.",
    "The tempo calculation based on beats in each minute.",
    "The number of beats counted in the span of 60 seconds in music.",
    "The beat-to-beat timing, defined in terms of beats per minute.",
    "The speed of musical execution, as measured in BPM.",
    "The rhythmic momentum of a piece, in terms of beats per minute.",
    "The measure of how fast or slow the music is in BPM.",
    "The song’s tempo, marked by the number of beats happening every minute.",
    "The timing of rhythmic events per minute.",
    "The average rate of beat progression in one minute of music.",
    "The rhythmic pulse of a song, detailed as BPM.",
    "The rate of beat occurrence, standardized to one minute.",
    "The musical timing defined by the number of beats within a 60-second window.",
    "The speed or pace of the music, indicated by beats measured per minute."
  ],
  "instruments": [
    "The collection of tools musicians use to create sound, like pianos, violins, or flutes.",
    "The set of musical devices, including instruments like guitars, trumpets, and synthesizers.",
    "The array of musical tools employed by performers to generate music.",
    "The ensemble of sound-producing objects such as drums, horns, and strings.",
    "The musical equipment, ranging from acoustic to electric instruments.",
    "The selection of sound-generating tools, such as violins, cellos, and clarinets.",
    "The various devices musicians use to produce melodies and rhythms.",
    "The assortment of sound-crafting tools like basses, keyboards, and saxophones.",
    "The musical apparatus used to generate tones, rhythms, and harmonies.",
    "The lineup of tools for producing music, including guitars, pianos, and drums.",
    "The range of acoustic or electronic devices used by musicians to create sound.",
    "The collection of tools that performers use to play music, from violins to flutes.",
    "The musical devices, including brass, woodwinds, and percussion instruments.",
    "The group of tools used to shape musical sound, like strings and keyboards.",
    "The variety of musical objects, such as harps, trumpets, and synthesizers.",
    "The equipment musicians use to produce notes and beats, from guitars to drums.",
    "The instruments, from acoustic guitars to electric pianos, used to perform music.",
    "The array of tools, such as violins and marimbas, that musicians play.",
    "The devices used to create melodies, harmonies, and rhythms in music.",
    "The selection of instruments used to craft musical pieces, like cellos and clarinets.",
    "The tools musicians rely on to generate sounds, such as violins, flutes, and drums.",
    "The collection of sound-producing tools, from brass to strings and percussion.",
    "The ensemble of instruments used in creating a musical performance.",
    "The instruments, like trumpets, violins, and keyboards, that form the foundation of music.",
    "The group of sound-making devices used by musicians to produce their art.",
    "The assortment of musical tools, including percussion, strings, and winds.",
    "The musical objects used to create sound, such as violins, drums, and guitars.",
    "The set of devices used to generate musical tones, from trumpets to synthesizers.",
    "The instruments, ranging from pianos to guitars, that shape a musical work.",
    "The variety of musical devices used by performers, like violins and basses.",
    "The tools of music-making, such as keyboards, harps, and trombones.",
    "The selection of instruments used by musicians, including drums and pianos.",
    "The devices for sound production, such as flutes, violas, and electronic drums.",
    "The lineup of instruments musicians use to create different sounds and rhythms.",
    "The ensemble of sound-producing tools, such as guitars, saxophones, and tambourines.",
    "The collection of musical equipment, including both traditional and modern instruments.",
    "The range of instruments used to create the tonal and rhythmic foundation of a song.",
    "The various devices, such as trumpets, guitars, and pianos, employed in music-making.",
    "The instruments that musicians use to bring melodies and harmonies to life.",
    "The lineup of tools used by performers, from brass instruments to strings and percussion.",
    "The musical devices, such as violins and flutes, that musicians rely on to create sound.",
    "The tools for creating music, like acoustic guitars, electronic drums, and violins.",
    "The selection of sound-generating objects, including keyboards, drums, and clarinets.",
    "The instruments that make up a musical ensemble, from horns to guitars and basses.",
    "The variety of sound-producing devices used by musicians in different genres.",
    "The musical tools, ranging from violas to drum kits, that help craft compositions.",
    "The instruments, like marimbas, trumpets, and synthesizers, that musicians play.",
    "The tools for sound creation, such as acoustic instruments or digital synthesizers.",
    "The set of musical objects, including strings, brass, and electronic instruments.",
    "The musical equipment, from pianos to drums, that performers use to produce sound."
  ],
  "chord": [
    "A series of chords arranged in a timed order throughout a piece of music.",
    "A structured sequence of harmonies played at specific intervals.",
    "A progression of chords marked by timestamps that create the harmonic flow.",
    "A chronological arrangement of chords defining the harmonic backbone of a song.",
    "A timed progression of chords that outlines the harmonic structure.",
    "A set of chords played in a predefined order, each with its own timestamp.",
    "A sequence of harmonic changes occurring at specific moments in the music.",
    "A timed series of chord changes that creates the foundation of a piece.",
    "A pattern of chords played in succession, guided by timestamps.",
    "A stepwise progression of chords, played in a specific time sequence.",
    "A chain of harmonic shifts that happen in a defined time structure.",
    "A list of chords that occur in a timed pattern within a composition.",
    "A chordal sequence following a fixed timestamped pattern.",
    "A series of harmonic movements defined by chord changes at precise times.",
    "A prearranged chord pattern that progresses with specific timing.",
    "A chord structure with each change happening at a designated time.",
    "A sequence of chords that unfold over time, defining the harmonic rhythm.",
    "A time-bound progression of chords that drives the harmonic framework.",
    "A set of chords played sequentially at specific intervals.",
    "A series of harmonic shifts that happen according to the musical timeline.",
    "A sequence of timed chords that build the harmonic narrative of a piece.",
    "A succession of chords played in a structured, timestamped order.",
    "A series of chords progressing in a fixed sequence with a timed structure.",
    "A harmonic roadmap marked by chords played at set intervals.",
    "A string of chords, each played at a specific moment in the composition.",
    "A predefined harmonic pattern with chords played in timed intervals.",
    "A succession of harmonies ordered by a specific timing scheme.",
    "A rhythmic chord progression that evolves over specific time markers.",
    "A timeline of chords, each played in a designated order.",
    "A harmonic progression with each chord played at a precise moment.",
    "A timed harmonic sequence defining the flow of the composition.",
    "A set of chords arranged chronologically to form a harmonic pattern.",
    "A chord sequence that follows a particular timing to create harmonic shifts.",
    "A harmonic journey mapped by chords at specific timestamps.",
    "A step-by-step progression of chords, played at designated moments.",
    "A sequence of harmonic shifts occurring at specific time intervals.",
    "A series of chords arranged with timestamps to guide their progression.",
    "A structured harmonic sequence that unfolds over time.",
    "A timestamped arrangement of chords that outlines the music's harmonic path.",
    "A sequence of chords happening at timed intervals throughout a piece.",
    "A time-based arrangement of chords that form the harmonic progression.",
    "A progression of chords, each appearing at a specific moment in the song.",
    "A series of harmonies played in a specific timed pattern.",
    "A harmonic flow driven by chords played at marked moments in the music.",
    "A structured sequence of harmonic changes with defined timestamps.",
    "A chordal framework that progresses in time-based intervals.",
    "A set of harmonic movements that follow a timestamped order.",
    "A rhythmically timed chord progression forming the harmonic basis of a track.",
    "A specific sequence of chords arranged with time markers in a composition.",
    "A stepwise harmonic sequence that follows a specific timeline in the piece."
  ],
  "key": [
    "The tonal center that defines the pitch range of a composition.",
    "The home note or scale that governs the pitch relationships in a piece.",
    "The tonal framework that sets the harmonic foundation of a track.",
    "The main scale that dictates the pitches and harmonies used in the music.",
    "The pitch set around which a composition is built.",
    "The musical mode that establishes the tonal center of a piece.",
    "The tonal environment that provides the pitch structure of the music.",
    "The central pitch and scale that shape the harmonic progression.",
    "The fundamental tonality that determines the song's pitch and harmonic mood.",
    "The primary scale that governs the notes and chords of a piece.",
    "The scale or mode around which the music revolves.",
    "The pitch center and scale that establish the harmonic atmosphere.",
    "The tonal basis that influences the harmonic and melodic elements.",
    "The overall tonal landscape that defines the song's harmonic language.",
    "The specific scale that sets the mood and pitch framework of a composition.",
    "The foundational pitch and harmonic context for the music.",
    "The tonal orientation that gives structure to the melody and harmony.",
    "The harmonic field defined by a central note and its related scale.",
    "The pitch region that organizes the notes and chords in the music.",
    "The key signature that identifies the scale and tonic of a piece.",
    "The harmonic framework that establishes the mood of the composition.",
    "The musical center of gravity around which the notes and chords orbit.",
    "The dominant scale that sets the tonal mood of the track.",
    "The harmonic space defined by a tonic note and corresponding scale.",
    "The tonal organization that shapes the melodic and harmonic flow.",
    "The primary tonality that governs the relationships between pitches.",
    "The central note and scale that determine the harmonic mood.",
    "The harmonic palette defined by the chosen key and its corresponding chords.",
    "The tonal field that directs the pitch relationships within the music.",
    "The pitch collection that provides the foundation for the melody and harmony.",
    "The central tonality that controls the scale and chord choices.",
    "The harmonic backdrop that creates the tonal mood of the piece.",
    "The fundamental tonality around which the piece's pitches are organized.",
    "The pitch framework that dictates the harmonic and melodic movement.",
    "The main scale and tonic that set the overall tonality of the music.",
    "The harmonic center that defines the piece's pitch relationships.",
    "The chosen pitch set that determines the track's tonal character.",
    "The tonal area that establishes the mood and harmonic structure.",
    "The pitch foundation that gives shape to the piece’s melody and harmony.",
    "The primary scale that dictates the harmonic color of the composition.",
    "The tonal core that governs the harmonic and melodic language.",
    "The scale and tonic note that define the pitch boundaries of the piece.",
    "The harmonic and tonal system that underlies the structure of the music.",
    "The chosen mode that establishes the key and harmonic mood.",
    "The harmonic scheme based on a central pitch and its related scale.",
    "The tonal structure that sets the mood and direction of the song.",
    "The pitch center that governs the relationships between the notes.",
    "The key signature that identifies the primary scale and tonic note.",
    "The musical tonality that shapes the emotional and harmonic mood.",
    "The tonal framework that dictates the pitch relationships and overall mood."
  ],
  "articulation": [
    "A score from 1 to 10 indicating how frequently staccato articulation is used in a piece.",
    "A rating that measures the degree of staccato notes in the music, from low to high.",
    "A scale from 1 to 10 reflecting how much of the music is played with staccato articulation.",
    "A score indicating the extent to which staccato notes dominate the music.",
    "A rating system assessing how much of a piece is articulated in staccato, from 1 to 10.",
    "A measure of the proportion of notes articulated with staccato in a musical piece.",
    "A scale rating how staccato-heavy a composition is, from minimal to extensive.",
    "A score representing the level of staccato articulation throughout a piece.",
    "A rating indicating how prevalent staccato articulation is in the music.",
    "A measure of how frequently staccato notes are played in a musical passage.",
    "A score evaluating how much of the melody is articulated with staccato notes.",
    "A rating that reflects the proportion of notes using staccato in a performance.",
    "A scale that gauges how strongly staccato articulation defines the music, rated from 1 to 10.",
    "A score that measures the staccato intensity in a piece, from light to heavy.",
    "A rating system that quantifies how much staccato articulation is present in a track.",
    "A measure of how prominent staccato notes are in the overall articulation of the piece.",
    "A score indicating the extent to which staccato defines the character of the music.",
    "A rating that reflects how much of the music consists of staccato notes.",
    "A scale from 1 to 10 that measures the presence of staccato articulation in the composition.",
    "A score that assesses the overall staccato content in a musical work.",
    "A measure of how many staccato notes are played relative to the rest of the articulation.",
    "A rating indicating the dominance of staccato in the articulation style.",
    "A score reflecting the frequency of staccato passages in the music, rated from 1 to 10.",
    "A scale that measures how often staccato articulation is employed throughout the piece.",
    "A score indicating the extent of staccato used within the musical structure.",
    "A rating system that quantifies the prevalence of staccato notes in the performance.",
    "A measure of how many short, detached staccato notes appear in a piece.",
    "A score that rates the overall staccato articulation present in the music.",
    "A rating reflecting how much of the piece is characterized by staccato articulation.",
    "A scale that assesses the use of staccato in shaping the articulation of the music.",
    "A score indicating how frequently staccato dominates the articulation of the composition.",
    "A rating system measuring the proportion of the piece that employs staccato articulation.",
    "A measure of the extent to which staccato notes influence the articulation style.",
    "A score representing the frequency of staccato notes within the piece, rated from 1 to 10.",
    "A rating that gauges the intensity of staccato articulation used in the track.",
    "A scale measuring how much staccato articulation is featured in the composition.",
    "A score assessing the overall presence of staccato in the articulation of the music.",
    "A measure of the ratio of staccato to other articulations within a piece.",
    "A rating system that reflects how extensively staccato is applied in the performance.",
    "A score indicating the degree of staccato articulation throughout the musical passage.",
    "A scale that measures how much of the articulation is influenced by staccato.",
    "A rating reflecting the prominence of staccato articulation in the overall piece.",
    "A measure of how much the staccato articulation shapes the character of the melody.",
    "A score assessing the frequency of short, detached notes throughout the music.",
    "A rating system that quantifies how staccato-heavy the piece is, from 1 to 10.",
    "A scale indicating how prominent staccato is in defining the musical articulation.",
    "A score representing the proportion of staccato notes in the overall articulation pattern.",
    "A measure of how frequent and intense the staccato articulation is within the composition.",
    "A rating that reflects how often staccato is used to articulate the notes in a piece.",
    "A score indicating how much staccato articulation defines the rhythm and flow of the music."
  ],
  "dissonance": [
    "A rating reflecting how much the audio contains dissonant intervals like tritones or seconds.",
    "A measure of how noisy or harsh the timbre of the audio feels.",
    "A score indicating the presence of clashing intervals that create a sense of tension in the music.",
    "A rating evaluating how much the audio incorporates discordant, jarring sounds.",
    "A measure of how dissonant the harmonies and intervals in the music are.",
    "A score assessing how much dissonance is introduced through intervals like minor seconds and tritones.",
    "A rating reflecting the harshness or abrasiveness in the sound due to dissonant harmonies.",
    "A measure of how much tension is created by the use of unresolved, dissonant intervals.",
    "A score indicating how much the audio deviates from consonant, smooth harmonies.",
    "A rating assessing the level of auditory clash or noise in the music's timbre.",
    "A measure of how prominently dissonant intervals like diminished fifths appear in the audio.",
    "A score evaluating the degree of sharp, conflicting sounds within the harmony.",
    "A rating reflecting how noisy or discordant the overall sound is due to harsh intervals.",
    "A measure of how much unresolved dissonance is present in the composition.",
    "A score indicating how much auditory tension exists due to dissonant pitches.",
    "A rating system measuring the presence of sharp, clashing intervals and harmonies.",
    "A score reflecting the extent to which the audio incorporates noisy or harsh timbres.",
    "A measure of how much the piece relies on dissonant intervals to create tension.",
    "A rating indicating the degree of auditory harshness caused by dissonant tones.",
    "A score evaluating how much tension and discord are produced by the intervals.",
    "A rating assessing how prevalent jarring, dissonant intervals are in the music.",
    "A measure of the roughness or abrasiveness in the sound caused by dissonance.",
    "A score reflecting the complexity and tension created by conflicting intervals.",
    "A rating indicating the use of dissonant intervals to create unsettling or noisy sounds.",
    "A measure of how much dissonant tension builds throughout the music.",
    "A score evaluating the intensity of the clash between conflicting tones.",
    "A rating reflecting how discordant and tense the harmonic structure is.",
    "A measure of how much the music emphasizes harsh intervals over consonant ones.",
    "A score indicating the frequency of dissonant intervals in the harmonic framework.",
    "A rating assessing the harshness of the sound based on dissonant relationships between notes.",
    "A measure of how noisy or jarring the timbre feels due to the use of dissonance.",
    "A score reflecting the extent to which dissonant sounds dominate the audio.",
    "A rating indicating how much dissonance is used to create a sense of unease in the music.",
    "A measure of the complexity and harshness in the harmonic texture due to dissonance.",
    "A score evaluating the impact of dissonant intervals on the overall tonal tension.",
    "A rating assessing how strongly the audio's timbre is characterized by noise or clash.",
    "A measure of how much the audio uses dissonant intervals to break traditional harmony.",
    "A score reflecting the level of tonal tension due to conflicting intervals in the music.",
    "A rating indicating the harshness of the music based on the use of dissonant harmonies.",
    "A measure of how much dissonant tension is created by close or conflicting pitches.",
    "A score evaluating the intensity of auditory dissonance caused by intervals like minor seconds.",
    "A rating reflecting the noisiness or harshness of the sound due to clashing intervals.",
    "A measure of how prominently dissonance shapes the harmonic landscape of the piece.",
    "A score indicating how much jarring, conflicting intervals appear in the music.",
    "A rating assessing how much of the sound is defined by dissonant, noisy textures.",
    "A measure of how dissonant intervals contribute to the overall tension in the music.",
    "A score reflecting the use of harsh intervals to create instability in the harmonic structure.",
    "A rating indicating how discordant and jarring the sound feels due to the presence of dissonance.",
    "A measure of how much the harmonic complexity is driven by clashing, dissonant intervals.",
    "A score evaluating the extent to which the timbre and harmony of the music are noisy or harsh due to dissonance."
  ],
  "melodiousness": [
    "A rating from 1 to 10 indicating the appeal of a melody based on its catchiness and singability.\n",
    "A score that assesses how tuneful and memorable a musical passage is, measured on a scale of 1 to 10.\n",
    "A scale from 1 to 10 that reflects the melodic charm and ease of humming or singing along.\n",
    "A numeric evaluation of a melody's attractiveness, scoring its tunefulness and memorability.\n",
    "A rating system that quantifies how pleasing and catchy a musical melody is, from 1 to 10.\n",
    "A measure of melodic quality that assesses how easy it is to remember and sing a tune.\n",
    "A scale that evaluates the catchiness and musical appeal of a melody, rated from 1 to 10.\n",
    "A score reflecting the musicality of a passage based on its ability to engage listeners and be easily recalled.\n",
    "A numerical representation of how tuneful and engaging a melody is, rated on a scale of 1 to 10.\n",
    "A rating from 1 to 10 that indicates how memorable and catchy a piece of music is.\n",
    "An assessment of a melody's singability and appeal, measured from 1 to 10.\n",
    "A score that evaluates how well a melody sticks in the listener's mind, ranging from 1 to 10.\n",
    "A numerical rating that reflects the overall tunefulness and charm of a melody.\n",
    "A quality measure for melodies based on how easy they are to hum or sing, rated from 1 to 10.\n",
    "A score indicating the catchiness and melodic quality of a musical piece, from 1 to 10.\n",
    "A ranking of a melody's appeal and memorability, measured on a scale of 1 to 10.\n",
    "A score that reflects the melodic attractiveness and ease of recall, rated from 1 to 10.\n",
    "An evaluation of how tuneful and engaging a musical passage is, from 1 to 10.\n",
    "A scale measuring the charm and catchiness of a melody, ranging from 1 to 10.\n",
    "A numerical assessment of a melody's quality based on its memorability and appeal.\n",
    "A score that indicates how easily a melody can be remembered or sung along to.\n",
    "A rating system for melodies based on their catchiness and overall musical quality, from 1 to 10.\n",
    "A quality measure for melodies that reflects their ability to engage listeners, rated from 1 to 10.\n",
    "A numeric scale that gauges how pleasing and memorable a melody is to listeners.\n",
    "An assessment of the melodic appeal of a piece, with a rating from 1 to 10.\n",
    "A score that measures how tuneful and catchy a melody is, providing a numeric evaluation.\n",
    "A ranking that reflects the singability and charm of a melody, rated from 1 to 10.\n",
    "A scale assessing how memorable and tuneful a musical passage is, with scores from 1 to 10.\n",
    "A score that reflects the overall catchiness and appeal of a melody, on a scale of 1 to 10.\n",
    "A numeric measure of a melody's ability to resonate with listeners, rated from 1 to 10.\n",
    "An evaluation of how enjoyable and easy to sing a melody is, from 1 to 10.\n",
    "A rating that captures the quality of a melody based on its tunefulness and memorability.\n",
    "A scale that quantifies the charm and catchiness of a melody, rated from 1 to 10.\n",
    "A numerical representation of how pleasing and engaging a melody is for listeners.\n",
    "A score that reflects the ease with which a melody can be hummed or sung, on a scale from 1 to 10.\n",
    "A rating system for the melodic quality of a piece, focusing on its catchiness and appeal.\n",
    "A numeric evaluation indicating how easily a melody can be remembered and enjoyed.\n",
    "A score from 1 to 10 that reflects the melodic charm and memorability of a passage.\n",
    "A measure of a melody's appeal based on its catchiness, rated on a scale of 1 to 10.\n",
    "A score that evaluates how engaging and tuneful a musical passage is for listeners.\n",
    "A rating reflecting the overall tunefulness and catchiness of a melody, on a scale from 1 to 10.\n",
    "A numerical assessment that indicates the charm and memorability of a melody.\n",
    "A score measuring the ease of singing or humming a melody, rated from 1 to 10.\n",
    "A quality measure of a melody's catchiness and musical appeal, on a scale of 1 to 10.\n",
    "A numeric score reflecting how memorable a melody is, rated from 1 to 10.\n",
    "A rating that captures the overall appeal and singability of a musical passage.\n",
    "A score indicating how easily a melody can engage listeners, on a scale of 1 to 10.\n",
    "A measurement of melodic quality based on its catchiness, ranging from 1 to 10.\n",
    "A numerical rating that assesses the tunefulness and charm of a melody.\n",
    "A score that reflects the quality of a melody in terms of its memorability and appeal, from 1 to 10."
  ],
  "rhythmic-complexity": [
    "A rating from 1 to 10 that reflects how intricate and layered the rhythm is.",
    "A measure of how many different rhythmic patterns interact within the music.",
    "A score evaluating the number of distinct layers contributing to the overall rhythm.",
    "A rating indicating how challenging the rhythm is to analyze due to its complexity.",
    "A score reflecting how rhythmically dense and multifaceted the music is.",
    "A measure of how difficult it is to perceive the full structure of the rhythm.",
    "A rating assessing the interaction of multiple rhythmic elements within the piece.",
    "A score indicating how many independent rhythms overlap in the music.",
    "A measure of how complex the rhythm feels due to unexpected changes in timing.",
    "A score reflecting how much variation exists within the rhythm’s structure.",
    "A rating system gauging the number of syncopations and irregularities in the rhythm.",
    "A measure of how diverse the rhythmic patterns are in the composition.",
    "A score indicating the complexity caused by rhythmic subdivisions and polyrhythms.",
    "A rating evaluating the number of contrasting rhythms played simultaneously.",
    "A score reflecting how challenging it is to grasp the rhythm due to its layered nature.",
    "A measure of the rhythmic diversity present in the music, from simple to complex.",
    "A rating that assesses the intricate relationship between different rhythmic layers.",
    "A score evaluating the complexity introduced by irregular timing and polyrhythmic structures.",
    "A measure of the difficulty of interpreting multiple rhythm lines at once.",
    "A score reflecting the use of advanced rhythmic techniques such as syncopation and cross-rhythm.",
    "A rating assessing the structural complexity of rhythm due to unexpected accents and pauses.",
    "A measure of how varied and multilayered the rhythm is in a piece of music.",
    "A score indicating how hard it is to follow the rhythm due to its non-repetitive patterns.",
    "A rating that reflects the use of overlapping, asynchronous rhythms.",
    "A score evaluating the degree of rhythmic complexity caused by contrasting tempos.",
    "A measure of the interaction between multiple rhythmic motifs throughout the music.",
    "A score reflecting the complexity arising from shifting time signatures and meters.",
    "A rating system gauging how disjointed or unpredictable the rhythm appears.",
    "A score indicating how challenging it is to detect the primary rhythmic pattern.",
    "A measure of the number of rhythmic layers that move independently.",
    "A score reflecting the complexity of rhythms that include polyrhythms and syncopation.",
    "A rating that evaluates how fragmented or interconnected the rhythm feels.",
    "A measure of the difficulty caused by frequent rhythmic shifts and irregular beats.",
    "A score indicating the use of complex rhythmic cycles and non-standard meters.",
    "A rating assessing the interplay between rhythms of different lengths and accents.",
    "A measure of how challenging it is to comprehend multiple intertwined rhythmic layers.",
    "A score reflecting the complexity resulting from rhythms that vary in density and texture.",
    "A rating evaluating the intricate timing and rhythm changes throughout the piece.",
    "A score indicating how intricate the rhythmic interplay is between different instruments.",
    "A measure of how the rhythm defies expectations through unexpected accents and syncopation.",
    "A score evaluating the use of cross-rhythms and contrasting beats in the music.",
    "A rating that reflects the rhythmic complexity created by non-standard groupings.",
    "A measure of the difficulty in distinguishing the primary rhythmic pulse due to layered rhythms.",
    "A score indicating how rhythmically complex the piece is due to changing patterns.",
    "A rating assessing the complexity caused by polyphonic rhythmic structures.",
    "A measure of how many independent rhythmic voices coexist within the piece.",
    "A score reflecting how intricate the rhythm feels due to evolving rhythmic motifs.",
    "A rating indicating the use of irregular rhythmic groupings and unpredictable timing.",
    "A score evaluating the rhythmic complexity introduced by frequent tempo shifts and syncopation.",
    "A measure of the interaction and complexity between several overlapping rhythmic ideas."
  ],
  "tonal-stability": [
    "A rating that measures how consistently the tonal center is maintained throughout the music.",
    "A score indicating the stability of the key across the composition.",
    "A measure of how firmly the music holds its tonal center without deviation.",
    "A rating reflecting how stable the key remains from start to finish.",
    "A score assessing how consistently the tonic is reinforced across the piece.",
    "A measure of how well the tonal center is maintained without modulations.",
    "A score indicating how stable and unchanging the key is in the composition.",
    "A rating evaluating the consistency of the tonal center throughout the music.",
    "A score reflecting how firmly the key is established and held across the piece.",
    "A measure of how stable the tonal foundation remains during the entire composition.",
    "A score indicating how clearly the key and tonal center are sustained without shifting.",
    "A rating assessing the strength of the tonal center and its consistency.",
    "A measure of how firmly the music stays rooted in its key throughout.",
    "A score reflecting the steadiness of the key without any tonal drift.",
    "A rating indicating the degree to which the tonal center is anchored in the music.",
    "A measure of how consistently the key is established and maintained.",
    "A score evaluating the stability of the tonic as the harmonic anchor.",
    "A rating assessing how steadily the music adheres to its tonal center.",
    "A score reflecting the firmness of the key and its consistency across the composition.",
    "A measure of how well the tonal center is preserved without modulation or ambiguity.",
    "A rating indicating how firmly the key is grounded throughout the music.",
    "A score evaluating how stable the key remains without deviation or modulation.",
    "A measure of the consistency of the tonal center from the beginning to the end of the piece.",
    "A score reflecting how securely the key is maintained over the course of the music.",
    "A rating assessing how much the tonal center remains unchanged throughout the piece.",
    "A measure of how strongly the key is reinforced without modulation.",
    "A score indicating the clarity and stability of the tonal center in the composition.",
    "A rating reflecting the degree to which the key is held without shifting.",
    "A measure of how consistently the tonal center provides a stable foundation for the music.",
    "A score evaluating how clearly the key is defined and maintained.",
    "A rating indicating the stability of the harmonic structure in supporting the tonic.",
    "A measure of how unwavering the tonal center remains throughout the piece.",
    "A score reflecting how much the key remains intact without modulation.",
    "A rating assessing the steadiness of the key and tonal center across the composition.",
    "A measure of how well the music maintains its tonal center without harmonic shifts.",
    "A score indicating the degree of stability in the key without any tonal deviations.",
    "A rating evaluating how strongly the tonal center remains established.",
    "A measure of the consistency of the key throughout the entire composition.",
    "A score reflecting how well the tonic and key are held firm in the music.",
    "A rating indicating the stability of the tonal foundation without modulation.",
    "A measure of how consistent and stable the tonal center is from start to end.",
    "A score assessing how well the key is maintained across different sections of the piece.",
    "A rating reflecting the degree to which the key remains stable throughout the music.",
    "A measure of how much the tonal center stays constant without shifting or modulation.",
    "A score indicating the degree of stability in maintaining the tonic and key.",
    "A rating evaluating the clarity and firmness of the tonal center across the composition.",
    "A measure of how steady and unwavering the key remains during the performance.",
    "A score reflecting the consistency with which the tonic is held throughout the music.",
    "A rating assessing how well the harmonic structure preserves the key and tonal center.",
    "A measure of how stable the key is without significant modulation or shifts."
  ],
  "beats": [
    "The timepoints of each beat in a piece that form its rhythmic framework.",
    "The exact moments in time where each beat occurs within the music.",
    "The timestamps marking the rhythmic pulse throughout the piece.",
    "The precise timing of beats that establish the rhythm in the music.",
    "The time positions of the beats that shape the piece’s rhythm.",
    "The specific moments where each beat falls, creating the rhythmic structure.",
    "The points in time where the rhythmic pulse is felt in the music.",
    "The timestamp for each rhythmic pulse that drives the beat of the music.",
    "The defined moments when beats occur, setting the rhythm for the piece.",
    "The rhythmic timestamps that provide the foundation for timing in the music.",
    "The moments of each beat that underlie the rhythm of the piece.",
    "The precise points in time where the beats land, forming the rhythm.",
    "The timestamps for beats that create the rhythmic flow of the piece.",
    "The time markers for each beat that establish the musical pulse.",
    "The specific beat placements that define the rhythm of the composition.",
    "The timestamps that outline the rhythm and pace of the music.",
    "The exact timings of beats that set the rhythmic pace for the piece.",
    "The moments when beats occur, giving structure to the rhythm.",
    "The precise time of each beat that supports the music’s rhythm.",
    "The rhythmic landmarks where each beat occurs in time.",
    "The time coordinates for each beat, laying down the rhythmic grid.",
    "The moments in time when beats define the pulse of the music.",
    "The timestamp of each beat that provides the rhythmic outline.",
    "The beat timing that organizes the rhythm and flow of the music.",
    "The exact beat points that establish the rhythmic pattern of the piece.",
    "The rhythmic timestamps marking the occurrence of each beat.",
    "The time intervals at which beats define the rhythm of the composition.",
    "The precise placement of beats that form the rhythmic framework.",
    "The time points where each beat falls, organizing the rhythmic foundation.",
    "The timestamps that indicate when each beat occurs in the music.",
    "The precise beat timings that create the pulse and flow of the piece.",
    "The moments in time where beats lay the rhythmic foundation.",
    "The time markers for each beat that create the rhythmic structure.",
    "The timepoints for beats that provide the rhythmic underpinning of the music.",
    "The defined timestamps where beats occur in the composition’s rhythm.",
    "The rhythmic anchor points where each beat is placed in time.",
    "The moments of beats that set the rhythmic drive for the music.",
    "The timestamps that show the placement of each beat in the piece.",
    "The rhythmic pulse defined by the exact timings of the beats.",
    "The specific beat occurrences that mark the rhythmic contour of the music.",
    "The timing of beats that serves as the rhythmic guide for the piece.",
    "The time markings for each beat that form the rhythm’s structure.",
    "The beat moments that define the rhythmic flow and pace of the composition.",
    "The specific times at which beats occur, outlining the rhythmic backbone.",
    "The time points where beats are felt, establishing the music’s rhythm.",
    "The rhythmic time markers for each beat that shape the flow of the piece.",
    "The moments in time where the beats provide the rhythmic foundation.",
    "The beat timing that dictates the rhythmic pulse throughout the music.",
    "The timestamps that capture each beat’s role in the rhythmic structure.",
    "The exact beat timings that organize the rhythm and timing of the piece."
  ],
  "is_loop": [
    "A property indicating whether the music is designed to repeat seamlessly.",
    "A label that specifies if the music forms a continuous loop.",
    "A characteristic showing whether the music repeats from the end to the beginning.",
    "A marker that determines if the piece is structured as a loop.",
    "A feature indicating whether the music is intended to loop without interruption.",
    "A property describing if the music starts over after reaching the end.",
    "A tag that specifies if the music creates a repeating cycle.",
    "A designation showing if the music plays in a looped pattern.",
    "A feature that identifies whether the music is designed to loop continuously.",
    "A property that determines if the track is structured to repeat endlessly.",
    "A characteristic that identifies if the music cycles back to the beginning after finishing.",
    "A property indicating if the audio track is meant to repeat indefinitely.",
    "A tag that shows whether the music continuously restarts without stopping.",
    "A feature specifying if the track is intended to play in a repetitive loop.",
    "A marker that determines if the composition is structured to loop endlessly.",
    "A property that describes whether the music is built to repeat seamlessly.",
    "A designation showing if the music is arranged to restart after reaching the end.",
    "A feature that reflects whether the track is designed to loop continuously without breaks.",
    "A property indicating if the music forms a continuous repeating cycle.",
    "A label that specifies if the track plays in a looping fashion.",
    "A characteristic showing whether the music follows a repetitive looped structure.",
    "A marker that determines if the track will automatically restart after playing through.",
    "A feature that describes if the music is built to return to the start after ending.",
    "A tag indicating whether the track is created for continuous looping.",
    "A property reflecting if the composition is intended to loop infinitely.",
    "A label specifying whether the music is designed to play in a continuous loop.",
    "A characteristic showing if the track is meant to repeat without interruption.",
    "A marker that defines whether the music cycles back to the beginning upon completion.",
    "A feature that describes whether the track is structured to loop back seamlessly.",
    "A property indicating if the music creates a continuous, unbroken loop.",
    "A tag showing if the music automatically starts over when it reaches the end.",
    "A characteristic identifying if the track is composed as a looped sequence.",
    "A marker determining if the music repeats continuously from end to start.",
    "A feature reflecting whether the track is arranged to loop after playing through.",
    "A label describing whether the composition is designed to repeat without stopping.",
    "A property that determines if the music forms an infinite repeating cycle.",
    "A tag specifying whether the track is set to loop after finishing.",
    "A characteristic showing if the music is intended to play in a continuous loop.",
    "A marker that reflects if the track repeats back to the beginning automatically.",
    "A feature describing whether the track cycles through a loop seamlessly.",
    "A property indicating if the music is constructed for indefinite looping.",
    "A label showing if the music plays in a repetitive, endless loop.",
    "A characteristic identifying whether the track is structured to repeat continuously.",
    "A marker that defines whether the music starts over upon reaching the end.",
    "A feature describing whether the music loops back to the start without interruption.",
    "A property indicating if the music forms a seamless, repeating pattern.",
    "A tag that specifies if the music track is intended to repeat from the beginning.",
    "A characteristic showing whether the track continuously loops after playing.",
    "A marker that determines if the composition is built to cycle endlessly.",
    "A feature that identifies if the track is meant to play in a looping sequence."
  ],
  "genre": [
    "A category that defines a type of music based on its style and characteristics.",
    "A classification of music into different types or forms, like jazz, rock, or classical.",
    "A type of music identified by its specific style, sound, and traditions.",
    "A category used to group music that shares similar characteristics and influences.",
    "A musical classification that describes a distinct style or form of music.",
    "A type of music categorized by its particular sound and thematic elements.",
    "A category of music that groups songs with similar stylistic features.",
    "A classification that identifies music by its unique style and structure.",
    "A type of music defined by common artistic elements like rhythm, melody, and harmony.",
    "A category that differentiates music based on its sound and cultural origins.",
    "A type of music that shares distinct characteristics with other songs in the same category.",
    "A label that groups music with similar sounds, themes, and instruments.",
    "A category that describes the overarching style and mood of a piece of music.",
    "A musical type recognized by shared forms and stylistic traits.",
    "A classification that defines music by its distinct style and musical features.",
    "A type of music that reflects particular cultural or artistic traditions.",
    "A category that organizes music by its style and performance practices.",
    "A type of music characterized by its distinctive form and expression.",
    "A grouping of music based on shared melodic, harmonic, and rhythmic patterns.",
    "A type of music that represents a specific artistic style or tradition.",
    "A category that identifies music by its recurring stylistic features.",
    "A type of music defined by its sound, rhythm, and instrumentation.",
    "A grouping of music that reflects similar artistic goals or cultural origins.",
    "A classification that sorts music into distinct types based on its sound and influence.",
    "A type of music characterized by common elements like tempo, structure, and mood.",
    "A category that labels music with a particular style or artistic intent.",
    "A type of music that is grouped with others that share a similar sonic identity.",
    "A category that describes music with a set of common structural elements.",
    "A type of music defined by its artistic focus and the instruments used.",
    "A grouping of music that reflects a shared creative direction or style.",
    "A category that labels music by the specific artistic techniques it employs.",
    "A type of music identified by its particular soundscapes and motifs.",
    "A classification that groups music based on shared structural and rhythmic elements.",
    "A type of music that represents a particular artistic expression or cultural heritage.",
    "A category that sorts music by its stylistic and thematic features.",
    "A type of music that reflects a distinct style in terms of arrangement and production.",
    "A grouping of music that shares thematic and stylistic similarities.",
    "A category that identifies music by its overarching style and typical elements.",
    "A type of music classified by its common sound features and compositional methods.",
    "A classification that groups music based on shared rhythm, melody, and harmony.",
    "A type of music defined by its cultural, artistic, or regional characteristics.",
    "A category that organizes music based on its unique stylistic signature.",
    "A type of music recognized by its distinct artistic approach and thematic elements.",
    "A classification that identifies music by the traits and features typical of its style.",
    "A type of music that is grouped based on its creative techniques and aesthetic goals.",
    "A category that sorts music according to shared compositional techniques and sound.",
    "A type of music categorized by its consistent use of certain musical elements.",
    "A grouping of music that reflects shared traditions, instruments, and forms.",
    "A category that defines music by the consistent artistic and sonic features it employs.",
    "A type of music identified by its unique form, instrumentation, and creative vision."
  ],
  "rhythmic-stability": [
    "A scale from 1 to 10, which refer to the consistency and predictability of the rhythmic patterns in the music."
  ],
  "modality": [
    "A scale from 1 to 10, with higher scores indicating a greater presence of minor elements in the music."
  ]
}